InformationRegisters/ТелеграмЖурнал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмЖурнал</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмСобытияЖурнала</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСвязи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмСпособыСвязи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пусто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмСервисы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмОбработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмЖурнал/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Бот, 
			Событие, 
			СпособСвязи, 
			Чат = Неопределено,
			Пользователь = Неопределено,
			Метод = Неопределено, 
			ОтветСервера = Неопределено, 
			Пусто = Ложь, 
			Пояснение = "", 
			Сервис = Неопределено, 
			Обработка = Неопределено, 
			Ошибка1С = Ложь, 
			ОшибкаТелеграм = Ложь,
			ОписаниеОшибки = "") Экспорт
			
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ТелеграмЖурнал");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();
	
	Если НЕ ЗначениеЗаполнено(Бот) Тогда
		Бот = Справочники.ТелеграмБоты.ПустаяСсылка();
	КонецЕсли;
				
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТелеграмЖурнал.НомерПП) КАК НомерПП
	|ИЗ
	|	РегистрСведений.ТелеграмЖурнал КАК ТелеграмЖурнал
	|ГДЕ
	|	ТелеграмЖурнал.Бот = &Бот";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	НомерПП = ?(Выборка.НомерПП = NULL, 1, Выборка.НомерПП + 1);
	
	МЗ = РегистрыСведений.ТелеграмЖурнал.СоздатьМенеджерЗаписи();
	МЗ.Бот = Бот;
	МЗ.НомерПП = НомерПП;
	МЗ.Дата = ТекущаяДата();
	МЗ.Событие = Событие;
	МЗ.СпособСвязи = СпособСвязи;
	МЗ.Чат = Чат;
	МЗ.Пользователь = Пользователь;
	МЗ.Метод = Метод;
	МЗ.ОтветСервера = ОтветСервера;
	МЗ.Пусто = Пусто;
	МЗ.Пояснение = Пояснение;
	МЗ.Сервис = Сервис;
	МЗ.Обработка = Обработка;
	МЗ.Ошибка = Ошибка1С;
	МЗ.ОшибкаТ = ОшибкаТелеграм;
	МЗ.ОписаниеОшибки = ОписаниеОшибки;
	МЗ.Записать();
	
	ЗафиксироватьТранзакцию();
	
	Если Ошибка1С ИЛИ ОшибкаТелеграм Тогда
		Сообщить(СтрШаблон("Зафиксирована ошибка %1 при выполнении обработки, подробности в журнале, запись №%2", ?(Ошибка1С, "1С", "Telegram"), НомерПП));
	КонецЕсли;
	
КонецПроцедуры

Процедура Очистить() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТелеграмЖурнал.Бот,
	|	ЕСТЬNULL(ТелеграмБоты.ХранитьЖурналДней, 90) КАК ХранитьЖурналДней
	|ИЗ
	|	РегистрСведений.ТелеграмЖурнал КАК ТелеграмЖурнал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТелеграмБоты КАК ТелеграмБоты
	|		ПО ТелеграмЖурнал.Бот = ТелеграмБоты.Ссылка";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмЖурнал.НомерПП
	|ИЗ
	|	РегистрСведений.ТелеграмЖурнал КАК ТелеграмЖурнал
	|ГДЕ
	|	ТелеграмЖурнал.Бот = &Бот
	|	И ТелеграмЖурнал.Дата < &ДатаЖурнала";
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмЖурнал.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		ДатаЖурнала = ТекущаяДата() - Выборка.ХранитьЖурналДней * 24 * 60 * 60;
		Запрос.УстановитьПараметр("Бот", Выборка.Бот);
		Запрос.УстановитьПараметр("ДатаЖурнала", ДатаЖурнала);
		ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			МенеджерЗаписи.Бот = Выборка.Бот;
			МенеджерЗаписи.НомерПП = ВыборкаЗаписей.НомерПП;
			МенеджерЗаписи.Удалить();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
